In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

2.2.2

In [3]:
data = {
    'c_1': [4,3,2,1],
    'c_2': ['a', 'b', 'c', 'd']
}
print(data)
df_data = pd.DataFrame(data) # 2D
print(df_data)

{'c_1': [4, 3, 2, 1], 'c_2': ['a', 'b', 'c', 'd']}
   c_1 c_2
0    4   a
1    3   b
2    2   c
3    1   d

In [5]:
student_data = {
    'Name': ["ali", "sara", "reza", "saeid"],
    'age': [25, 30, 22, 28],
    "Score": [88, 92, 79, 95]
}
df_student_data = pd.DataFrame(student_data) # 2D
print(df_student_data)

    Name  age  Score
0    ali   25     88
1   sara   30     92
2   reza   22     79
3  saeid   28     95

In [6]:
# check basic info
print(df_student_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   age     4 non-null      int64
 2   Score   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes
None

In [7]:
# read from csv file
stu_info = pd.read_csv("dataset/stu_info_2024.csv")
# print(stu_info)
df_stu_info = pd.DataFrame(stu_info)
print(df_stu_info)

    Name  age  Score
0    ali   25     88
1   nima   26     45
2  pouya   24     75
3  saeid   28     96
4   reza   29     35
5  samad   27     49

In [8]:
print(df_stu_info.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   age     6 non-null      int64
 2   Score   6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 276.0+ bytes
None

In [9]:
# basic statistics
print(df_stu_info.describe())

             age      Score
count   6.000000   6.000000
mean   26.500000  64.666667
std     1.870829  25.081201
min    24.000000  35.000000
25%    25.250000  46.000000
50%    26.500000  62.000000
75%    27.750000  84.750000
max    29.000000  96.000000

In [10]:
print(df_stu_info.describe(include="all"))

       Name        age      Score
count     6   6.000000   6.000000
unique    6        NaN        NaN
top     ali        NaN        NaN
freq      1        NaN        NaN
mean    NaN  26.500000  64.666667
std     NaN   1.870829  25.081201
min     NaN  24.000000  35.000000
25%     NaN  25.250000  46.000000
50%     NaN  26.500000  62.000000
75%     NaN  27.750000  84.750000
max     NaN  29.000000  96.000000

In [11]:
# Fech one of column in dataframe
print(df_stu_info["Name"])

0      ali
1     nima
2    pouya
3    saeid
4     reza
5    samad
Name: Name, dtype: object

In [12]:
print(df_stu_info[["Name", "Score"]])

    Name  Score
0    ali     88
1   nima     45
2  pouya     75
3  saeid     96
4   reza     35
5  samad     49

In [13]:
# filter or search into you'r data
print(df_stu_info[df_stu_info["Score"] > 80])

    Name  age  Score
0    ali   25     88
3  saeid   28     96

In [14]:
# add a new column
df_stu_info["Passed"] = df_stu_info["Score"] > 80
print(df_stu_info)

    Name  age  Score  Passed
0    ali   25     88    True
1   nima   26     45   False
2  pouya   24     75   False
3  saeid   28     96    True
4   reza   29     35   False
5  samad   27     49   False

In [15]:
df_stu_info["description"] = "-"
print(df_stu_info)

    Name  age  Score  Passed description
0    ali   25     88    True           -
1   nima   26     45   False           -
2  pouya   24     75   False           -
3  saeid   28     96    True           -
4   reza   29     35   False           -
5  samad   27     49   False           -

In [16]:
# drop a column
"""
axis = 1 => Column
axis = 0 => Row
"""
df_stu_info = df_stu_info.drop("description", axis=1)
print(df_stu_info)

    Name  age  Score  Passed
0    ali   25     88    True
1   nima   26     45   False
2  pouya   24     75   False
3  saeid   28     96    True
4   reza   29     35   False
5  samad   27     49   False

In [17]:
# sort
print(df_stu_info.sort_values(by="Score", ascending=False))

    Name  age  Score  Passed
3  saeid   28     96    True
0    ali   25     88    True
2  pouya   24     75   False
5  samad   27     49   False
1   nima   26     45   False
4   reza   29     35   False

In [18]:
# Average score by age
print(df_stu_info.groupby("age")["Score"].mean())

age
24    75.0
25    88.0
26    45.0
27    49.0
28    96.0
29    35.0
Name: Score, dtype: float64

In [19]:
df2 = df_stu_info.copy()
# print(df2)
# df2.loc[1, "Score"] = np.nan # loc => location
df2.loc[1, "Score"] = 96 # loc => location
print(df2)

    Name  age  Score  Passed
0    ali   25     88    True
1   nima   26     96   False
2  pouya   24     75   False
3  saeid   28     96    True
4   reza   29     35   False
5  samad   27     49   False

In [20]:
df2.fillna(df2["Score"].mean(), inplace=True) # fill NaN with mean
df2

    Name  age  Score  Passed
0    ali   25     88    True
1   nima   26     96   False
2  pouya   24     75   False
3  saeid   28     96    True
4   reza   29     35   False
5  samad   27     49   False

In [21]:
df_clean = df2.dropna()
print("\n DataFrame after dropping rows with NaN:")
df_clean

 DataFrame after dropping rows with NaN:

    Name  age  Score  Passed
0    ali   25     88    True
1   nima   26     96   False
2  pouya   24     75   False
3  saeid   28     96    True
4   reza   29     35   False
5  samad   27     49   False

In [22]:
data_01 = pd.DataFrame({
    "Name": ["Alice", "Jack", "rock"],
    "Age": [24,25,25],
    "Score": [88,92,46]
    })

data_extra = pd.DataFrame({
    "Name": ["Alice", "Jack", "rock"],
    "City": ["tbz", "urm", "shir"],
})

merged = pd.merge(data_01, data_extra)
print("\n----------- data 01 -----------")
print(data_01)
print("\n----------- data extra --------")
print(data_extra)
print("\n----------- merged ------------")
print(merged)

----------- data 01 -----------
    Name  Age  Score
0  Alice   24     88
1   Jack   25     92
2   rock   25     46

----------- data extra --------
    Name  City
0  Alice   tbz
1   Jack   urm
2   rock  shir

----------- merged ------------
    Name  Age  Score  City
0  Alice   24     88   tbz
1   Jack   25     92   urm
2   rock   25     46  shir

In [23]:
data_02 = pd.DataFrame({
    "Name": ["Alice", "Jack", "bob", "ros"],
    "Age": [24,25,25,27],
    "Score": [88,92,46,79]
    })

data_extra_02 = pd.DataFrame({
    "Name": ["Alice", "Jack", "bob"],
    "City": ["tbz", "urm", "shir"],
})

merged_02 = pd.merge(data_02, data_extra_02)
print("\n----------- data 01 -----------")
print(data_02)
print("\n----------- data extra --------")
print(data_extra_02)
print("\n----------- merged ------------")
print(merged_02)

----------- data 01 -----------
    Name  Age  Score
0  Alice   24     88
1   Jack   25     92
2    bob   25     46
3    ros   27     79

----------- data extra --------
    Name  City
0  Alice   tbz
1   Jack   urm
2    bob  shir

----------- merged ------------
    Name  Age  Score  City
0  Alice   24     88   tbz
1   Jack   25     92   urm
2    bob   25     46  shir

In [24]:
# ---- series: one- dimensional array with label
s = pd.Series([10,20,30,40], index=['a', 'b', 'c', 'd'])
print("------ Series -------")
print(s)
print("Type of variable s: ", type(s))

------ Series -------
a    10
b    20
c    30
d    40
dtype: int64
Type of variable s:  <class 'pandas.core.series.Series'>